from enum import Enum

class GuDongEnum(Enum):
    seongbuk_gu_dong = {
        "gu":"성북구",
        "dong": [
                "성북동",
                "삼선동",
                "동선동",
                "돈암1동",
                "돈암2동",
                "안암동",
                "보문동",
                "정릉1동",
                "정릉2동",
                "정릉3동",
                "정릉4동",
                "길음1동",
                "길음2동",
                "종암동",
                "월곡1동",
                "월곡2동",
                "장위1동",
                "장위2동",
                "장위3동",
                "석관동"]
    }

    ganwak_gu_dong = {
        "gu":"관악구",
        "dong":['보라매동',
                '은천동',
                '성현동', 
                '중앙동', 
                '청림동', 
                '행운동', 
                '청룡동', 
                '낙성대동', 
                '인헌동', 
                '남현동', 
                '신림동', 
                '신사동', 
                '조원동', 
                '미성동', 
                '난곡동', 
                '난향동', 
                '서원동', 
                '신원동', 
                '서림동', 
                '삼성동', 
                '대학동'
                ],
    }
    
    jongro_gu_dong = {
        "gu":"종로구",
        "dong":[
            '청운효자동', 
            '사직동', 
            '삼청동', 
            '부암동', 
            '평창동', 
            '무악동', 
            '교남동', 
            '가회동', 
            '종로1.2.3.4가동', 
            '종로5.6가동', 
            '이화동', 
            '혜화동', 
            '창신1동', 
            '창신2동', 
            '창신3동', 
            '숭인1동', 
            '숭인2동'
        ]
    }
